/*
USD              доллар США
JPY               японская иена
GBP (STG)    английский фунт стерлингов
CHF (SFR)    швейцарский франк
NLG (DFL)    нидерландский гульден
AUD             австралийский доллар
NZD             новозеландский доллар
MXN             мексиканское песо
CAD             канадский доллар
SGD             сингапурский доллар
HKD             гонконгский доллар
KRW            южнокорейская вона
ZAR             южноафриканский ранд
SEK             шведская крона
NOK            норвежская крона
DKK            датская крона
FIM             финская марка
RUR            российский рубль
 */
public enum Currency {
    USD, JPY, GBP, CHF, NLG, AUD, NZD, MXN, CAD, SGD, HKD, KRW, ZAR, SEK, NOK, DKK, FIM, RUR
}

